content/blog.org
#+hugo_base_dir: ../
#+hugo_section: pages



** Using GNU Screen
:PROPERTIES:
:EXPORT_FILE_NAME: using-gnu-screen
:EXPORT_HUGO_PUBLISHDATE: 2021-12-18
:END:
*** The Problem
So it all started with a simple problem. /How to I connect to the console port on my Extreme Summit X440 switch?/ Luckily in the past I remembered that I could use =minicom=. It a great application to connect to console sessions. I used it way back in the day to connect to Cisco switches. If it wasn't for the fact that I had use an actual Cisco switch for a class I would have totally forgotten about it. But what does this have to do with =GNU Screen=?
*** A Surprising Solution
One afternoon I was surfing the web and came across a blerb of information that blew my mind. Screen can be used to connect to console sessions! I had recently been trying to redo my workflow to incorporate a terminal multiplexer. Most folks use TMUX and TMUX is a great choice. But at first glance the keybinding just seem weird and not very intituive for me. So went down the rabbit hole of Youtube videos on Screen vs. TMUX. In the end I decided to give Screen a try and see if it was really true that you can connect to serial console sessions.
*** Screen and ttyUSB
In Linux console cables interface with =/dev/ttyUSB= ([[https://www.amazon.com/OIKWAN-Compatible-Opengear-Aruba%EF%BC%8CJuniper-Switches/dp/B075V1RGQK/ref=sr_1_1_sspa?crid=2MB6VVSMG5FAG&keywords=console%2Bcable&qid=1639881636&sprefix=console%2Bcabl%2Caps%2C190&sr=8-1-spons&spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUFIMExNREg5MUozSEcmZW5jcnlwdGVkSWQ9QTEwMjA3NzIzSEIwVllKTTBOM0JCJmVuY3J5cHRlZEFkSWQ9QTAwOTQxMzgzTEdHNTE3NktaWlVOJndpZGdldE5hbWU9c3BfYXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ&th=1][My console cable]]), this allows me to connect programs like minicom or screen to the serial connection. I did run into one small permissions issue when trying to run =screen /dev/ttyUSB0 9600=. Which led me to find out that I needed to add my user to the =dialout= group ([[https://www.arduino.cc/en/guide/linux#toc6][Arduino post]]). So I added my user like so =sudo usermod -a -G dialout myuser= and a quick reboot (a logout will work too) just to get things sorted. Once you log back in all you have to do is execute =screen /dev/ttyUSB0 9600= and you will get connected to your console session.
*** Old tools to the job
Sometimes old, tried, and true tools are the best. I'm glad I found out that GNU Screen can connect to console sessions. This allows me the flexibility of having a terminal multiplexer that is well rounded.
*** Some useful links
- GNU Screen Manual: https://www.gnu.org/software/screen/manual/screen.html
- Screen Baud Rate: https://www.cyberciti.biz/faq/unix-linux-apple-osx-bsd-screen-set-baud-rate/

If you enjoyed or found any of the content on my site helpful, you can buy me a cup of coffee so I can continue to bring you amazing content for free!
**** Thank You
:PROPERTIES:
:CUSTOM_ID: support
:align: left
:END:
[[https://www.buymeacoffee.com/eduardorobles][https://cdn.buymeacoffee.com/buttons/v2/default-yellow.png]]

